app/views/pages/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
              <span class="post-owner">
                <%= User.find(@p.user_id).username %>