app/controllers/pages_controller.rb

  def home
    @posts = Post.all
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC

  def profile
    # grab the username from the URL as: username
    # in the tutorial that man used params[:id] to get the username
    if(User.find_by_username(params[:username]))
      @username = params[:username]
    else
      redirect_to root_path, :notice => "User Not Found!"
    end
    @posts = Post.all.where("user_id= ?", User.find_by_username(params[:username]).id)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "karima sas"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id= 1)  ORDER BY "posts"."created_at" DESC

  def explore
    @posts = Post.all
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC