app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Content"], ["user_id", 1], ["created_at", "2016-09-30 11:49:19.917506"], ["updated_at", "2016-09-30 11:49:19.917506"]]
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id

        respond_to do |wants|
            if (@post.save)